{
  "nodes": [
    {
      "op": "null", 
      "name": "pfcand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 2], [4, 0, 2]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage1_basicblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 2], [13, 0, 2]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage1_basicblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage1_basicblock0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 2], [21, 0, 2]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage1_basicblock0_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[7, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage1_basicblock0_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 2], [28, 0, 2]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "jnet0_pfcand_stage1_basicblock0__plus0", 
      "inputs": [[22, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage1_basicblock0_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[30, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage1_basicblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[31, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 2], [37, 0, 2]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage1_basicblock1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[38, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage1_basicblock1_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage1_basicblock1_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 2], [45, 0, 2]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "jnet0_pfcand_stage1_basicblock1__plus0", 
      "inputs": [[46, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage1_basicblock1_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage2_basicblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 2], [54, 0, 2]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage2_basicblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage2_basicblock0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 2], [62, 0, 2]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage2_basicblock0_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[48, 0, 0], [64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage2_basicblock0_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[65, 0, 0], [66, 0, 0], [67, 0, 0], [68, 0, 2], [69, 0, 2]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "jnet0_pfcand_stage2_basicblock0__plus0", 
      "inputs": [[63, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage2_basicblock0_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage2_basicblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 2], [78, 0, 2]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage2_basicblock1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage2_basicblock1_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage2_basicblock1_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 2], [86, 0, 2]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "jnet0_pfcand_stage2_basicblock1__plus0", 
      "inputs": [[87, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage2_basicblock1_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage3_basicblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[89, 0, 0], [90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[91, 0, 0], [92, 0, 0], [93, 0, 0], [94, 0, 2], [95, 0, 2]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage3_basicblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage3_basicblock0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[99, 0, 0], [100, 0, 0], [101, 0, 0], [102, 0, 2], [103, 0, 2]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage3_basicblock0_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[89, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm2_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm2_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm2_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm2_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage3_basicblock0_batchnorm2_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 2], [110, 0, 2]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "jnet0_pfcand_stage3_basicblock0__plus0", 
      "inputs": [[104, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage3_basicblock0_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage3_basicblock1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[113, 0, 0], [114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 2], [119, 0, 2]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage3_basicblock1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_pfcand_stage3_basicblock1_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[121, 0, 0], [122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_pfcand_stage3_basicblock1_batchnorm1_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[123, 0, 0], [124, 0, 0], [125, 0, 0], [126, 0, 2], [127, 0, 2]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "jnet0_pfcand_stage3_basicblock1__plus0", 
      "inputs": [[128, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_pfcand_stage3_basicblock1_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[129, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "jnet0_pfcand_pool0_fwd", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(1, 1)", 
        "pad": "(0, 0)", 
        "pool_type": "avg", 
        "pooling_convention": "full", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "jnet0_pfcand_flatten0_flatten0", 
      "inputs": [[131, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_sv_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "True", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[133, 0, 0], [134, 0, 0], [135, 0, 0], [136, 0, 2], [137, 0, 2]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_sv_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_sv_stage1_basicblock0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[140, 0, 0], [141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm0_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm0_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm0_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm0_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm0_fwd", 
      "attrs": {
        "axis": "1", 
        "eps": "1e-05", 
        "fix_gamma": "False", 
        "momentum": "0.3", 
        "use_global_stats": "False"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0], [144, 0, 0], [145, 0, 2], [146, 0, 2]]
    }, 
    {
      "op": "Activation", 
      "name": "jnet0_sv_stage1_basicblock0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"in\", \"magnitude\": 2}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(32, 0, 3, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "jnet0_sv_stage1_basicblock0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 1)", 
        "layout": "NCHW", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[148, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm1_gamma", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm1_beta", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm1_running_mean", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(0,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "jnet0_sv_stage1_basicblock0_batchnorm1_running_var", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "ones", 
