{
  "nodes": [
    {
      "op": "null", 
      "name": "pfcand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_bn_data_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_bn_data_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_bn_data_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_bn_data_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_bn_data", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 1], [4, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "part_conv0_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_conv0", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage1_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[7, 0, 0], [8, 0, 0], [9, 0, 0], [10, 0, 1], [11, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage1_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage1_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage1_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[15, 0, 0], [16, 0, 0], [17, 0, 0], [18, 0, 1], [19, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage1_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage1_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage1_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[13, 0, 0], [24, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus0", 
      "inputs": [[23, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage1_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage1_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage1_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage1_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage1_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage1_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage1_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus1", 
      "inputs": [[42, 0, 0], [26, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage2_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[43, 0, 0], [44, 0, 0], [45, 0, 0], [46, 0, 1], [47, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage2_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[48, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage2_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[49, 0, 0], [50, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage2_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[51, 0, 0], [52, 0, 0], [53, 0, 0], [54, 0, 1], [55, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage2_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage2_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[57, 0, 0], [58, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage2_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[49, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus2", 
      "inputs": [[59, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage2_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 1], [66, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage2_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage2_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage2_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[70, 0, 0], [71, 0, 0], [72, 0, 0], [73, 0, 1], [74, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage2_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage2_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage2_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[76, 0, 0], [77, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus3", 
      "inputs": [[78, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage3_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 1], [83, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage3_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage3_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage3_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage3_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage3_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[93, 0, 0], [94, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage3_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[85, 0, 0], [96, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus4", 
      "inputs": [[95, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage3_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage3_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage3_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_stage3_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_stage3_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_stage3_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "part_stage3_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus5", 
      "inputs": [[114, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "part_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "part_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "part_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[115, 0, 0], [116, 0, 0], [117, 0, 0], [118, 0, 1], [119, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "part_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[120, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "part_pool1", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(1, 1)", 
        "pool_type": "avg"
      }, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "part_flatten", 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_bn_data_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_bn_data_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_bn_data_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_bn_data_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_bn_data", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.1"
      }, 
      "inputs": [[124, 0, 0], [125, 0, 0], [126, 0, 0], [127, 0, 1], [128, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "sv_conv0_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_conv0", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[129, 0, 0], [130, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_stage1_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[131, 0, 0], [132, 0, 0], [133, 0, 0], [134, 0, 1], [135, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_stage1_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage1_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[137, 0, 0], [138, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_stage1_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[139, 0, 0], [140, 0, 0], [141, 0, 0], [142, 0, 1], [143, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_stage1_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[144, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage1_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[145, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage1_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[137, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus6", 
      "inputs": [[147, 0, 0], [149, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_stage1_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[150, 0, 0], [151, 0, 0], [152, 0, 0], [153, 0, 1], [154, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_stage1_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage1_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[156, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_stage1_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[158, 0, 0], [159, 0, 0], [160, 0, 0], [161, 0, 1], [162, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_stage1_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage1_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage1_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[164, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus7", 
      "inputs": [[166, 0, 0], [150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_stage2_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0], [169, 0, 0], [170, 0, 1], [171, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_stage2_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage2_unit1_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[173, 0, 0], [174, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_stage2_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[175, 0, 0], [176, 0, 0], [177, 0, 0], [178, 0, 1], [179, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_stage2_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage2_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[181, 0, 0], [182, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit1_sc_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage2_unit1_sc", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "stride": "(2, 2)", 
        "workspace": "256"
      }, 
      "inputs": [[173, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus8", 
      "inputs": [[183, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_stage2_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0], [189, 0, 1], [190, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_stage2_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage2_unit2_conv1", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_stage2_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[194, 0, 0], [195, 0, 0], [196, 0, 0], [197, 0, 1], [198, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_stage2_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_stage2_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "sv_stage2_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(1, 0)", 
        "stride": "(1, 1)", 
        "workspace": "256"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "_plus9", 
      "inputs": [[202, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "sv_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "sv_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "sv_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.1"
      }, 
      "inputs": [[203, 0, 0], [204, 0, 0], [205, 0, 0], [206, 0, 1], [207, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "sv_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[208, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "sv_pool1", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(1, 1)", 
        "pool_type": "avg"
      }, 
      "inputs": [[209, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "sv_flatten", 
      "inputs": [[210, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[123, 0, 0], [211, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc1_fc_weight", 
      "attrs": {"num_hidden": "512"}, 
